[Survived] StringLiteral
routes/comments.js:31:13
 // });
 
 
-router.post('/', verifyToken, (req, res) => {
+router.post("", verifyToken, (req, res) => {
     const { book_id, content } = req.body;
     const user_id = req.user.id; 

[Killed] BlockStatement
routes/comments.js:35:31
     const { book_id, content } = req.body;
     const user_id = req.user.id; 
 
-    if (!book_id || !content) {
-        return res.status(400).send('All fields are required!');
-    }
+    if (!book_id || !content) {}
 
     if (typeof book_id !== 'number' || book_id <= 0){
killedBy: POST / should return 400 if book_id and content are missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "All fields are required!"
Received: "Invalid book ID!"

[Killed] ConditionalExpression
routes/comments.js:35:9
     const { book_id, content } = req.body;
     const user_id = req.user.id; 
 
-    if (!book_id || !content) {
+    if (false) {
         return res.status(400).send('All fields are required!');
     }
killedBy: POST / should return 400 if book_id and content are missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "All fields are required!"
Received: "Invalid book ID!"

[Killed] StringLiteral
routes/comments.js:36:37
     const user_id = req.user.id; 
 
     if (!book_id || !content) {
-        return res.status(400).send('All fields are required!');
+        return res.status(400).send("");
     }
 
killedBy: POST / should return 400 if book_id and content are missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "All fields are required!"
Received: ""

[Killed] ConditionalExpression
routes/comments.js:39:9
         return res.status(400).send('All fields are required!');
     }
 
-    if (typeof book_id !== 'number' || book_id <= 0){
+    if (false){
         return res.status(400).send('Invalid book ID!');
     }
killedBy: POST / should return 400 if book_id is invalid -> not a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
routes/comments.js:39:9
         return res.status(400).send('All fields are required!');
     }
 
-    if (typeof book_id !== 'number' || book_id <= 0){
+    if (false || book_id <= 0){
         return res.status(400).send('Invalid book ID!');
     }
killedBy: POST / should return 400 if book_id is invalid -> not a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
routes/comments.js:43:28
         return res.status(400).send('Invalid book ID!');
     }
 
-    if(content.length < 5) {
-        return res.status(400).send('Content is too short!');
-    }
+    if(content.length < 5) {}
 
     if(content.length > 500) {
killedBy: POST / should return 400 if content is too short
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
routes/comments.js:43:8
         return res.status(400).send('Invalid book ID!');
     }
 
-    if(content.length < 5) {
+    if(false) {
         return res.status(400).send('Content is too short!');
     }
killedBy: POST / should return 400 if content is too short
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
routes/comments.js:47:8
         return res.status(400).send('Content is too short!');
     }
 
-    if(content.length > 500) {
+    if(false) {
         return res.status(400).send('Content is too long!');
     }
killedBy: POST / should return 400 if content is too long
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
routes/comments.js:47:8
         return res.status(400).send('Content is too short!');
     }
 
-    if(content.length > 500) {
+    if(true) {
         return res.status(400).send('Content is too long!');
     }
killedBy: POST / should return 201 if comment is added successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Timeout] BlockStatement
routes/comments.js:52:9
     }
 
     const q = 'INSERT INTO comments (user_id, book_id, content) VALUES (?, ?, ?)';
-    try {
-        db.prepare(q).run(user_id, book_id, content);
-        return res.status(201).send('Comment added successfully!');
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error adding comment: ', error.message);
         return res.status(500).send('Error adding comment!');

[Killed] BlockStatement
routes/comments.js:55:21
     try {
         db.prepare(q).run(user_id, book_id, content);
         return res.status(201).send('Comment added successfully!');
-    } catch (error) {
-        console.error('Error adding comment: ', error.message);
-        return res.status(500).send('Error adding comment!');
-    }
+    } catch (error) {}
 });
 
killedBy: POST / should return 500 if there is an error adding the comment
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
