[Killed] BlockStatement
routes/reviews.js:35:30
     const { book_id, rating } = req.body;
     const user_id = req.user.id; 
 
-    if (!book_id || !rating) {
-        return res.status(400).send('All fields are required!');
-    }
+    if (!book_id || !rating) {}
 
     if (isNaN(rating) || rating < 1 || rating > 5) {
killedBy: POST /reviews should return 400 because rating < 1 and book_id is null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "All fields are required!"
Received: "Rating must be a number between 1 and 5."

[Killed] BooleanLiteral
routes/reviews.js:35:9
     const { book_id, rating } = req.body;
     const user_id = req.user.id; 
 
-    if (!book_id || !rating) {
+    if (book_id || !rating) {
         return res.status(400).send('All fields are required!');
     }
killedBy: POST /reviews should add a review
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
routes/reviews.js:39:9
         return res.status(400).send('All fields are required!');
     }
 
-    if (isNaN(rating) || rating < 1 || rating > 5) {
+    if (false) {
         return res.status(400).send('Rating must be a number between 1 and 5.');
     }
killedBy: POST /reviews should return 400 because rating > 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
routes/reviews.js:39:9
         return res.status(400).send('All fields are required!');
     }
 
-    if (isNaN(rating) || rating < 1 || rating > 5) {
+    if (false || rating > 5) {
         return res.status(400).send('Rating must be a number between 1 and 5.');
     }
killedBy: POST /reviews should return 400 because rating < 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] StringLiteral
routes/reviews.js:43:33
         return res.status(400).send('Rating must be a number between 1 and 5.');
     }
 
-    const checkDuplicateQuery = `
-        SELECT * FROM reviews WHERE user_id = ? AND book_id = ?;
-    `;
+    const checkDuplicateQuery = ``;
     const insertQuery = `
         INSERT INTO reviews (user_id, book_id, rating) VALUES (?, ?, ?);
killedBy: POST /reviews should return 400 if user already reviewed the book
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Timeout] BlockStatement
routes/reviews.js:50:9
         INSERT INTO reviews (user_id, book_id, rating) VALUES (?, ?, ?);
     `;
 
-    try {
-        const existingReview = db.prepare(checkDuplicateQuery).get(user_id, book_id);
-        if (existingReview) {
-            return res.status(400).send('You have already added a review for this book.');
-        }
-
-        db.prepare(insertQuery).run(user_id, book_id, rating);
-        return res.status(201).send('Review added successfully!');
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error adding review: ', error.message);
         return res.status(500).send('Error adding review!');

[Killed] ConditionalExpression
routes/reviews.js:52:13
 
     try {
         const existingReview = db.prepare(checkDuplicateQuery).get(user_id, book_id);
-        if (existingReview) {
+        if (false) {
             return res.status(400).send('You have already added a review for this book.');
         }
killedBy: POST /reviews should return 400 because review already exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
routes/reviews.js:52:29
 
     try {
         const existingReview = db.prepare(checkDuplicateQuery).get(user_id, book_id);
-        if (existingReview) {
-            return res.status(400).send('You have already added a review for this book.');
-        }
+        if (existingReview) {}
 
         db.prepare(insertQuery).run(user_id, book_id, rating);
killedBy: POST /reviews should return 400 if user already reviewed the book
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] StringLiteral
routes/reviews.js:53:41
     try {
         const existingReview = db.prepare(checkDuplicateQuery).get(user_id, book_id);
         if (existingReview) {
-            return res.status(400).send('You have already added a review for this book.');
+            return res.status(400).send("");
         }
 
killedBy: POST /reviews should return 400 because review already exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "You have already added a review for this book."
Received: ""

[Killed] BlockStatement
routes/reviews.js:58:21
 
         db.prepare(insertQuery).run(user_id, book_id, rating);
         return res.status(201).send('Review added successfully!');
-    } catch (error) {
-        console.error('Error adding review: ', error.message);
-        return res.status(500).send('Error adding review!');
-    }
+    } catch (error) {}
 });
 
killedBy: POST /reviews should return 500 if database throws error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
