[Timeout] BlockStatement
routes/library.js:46:9
     const { user_id, book_id } = req.params;
     const q = "SELECT * FROM library WHERE user_id = ? AND book_id = ?";
     
-    try {
-        if(!user_id.trim() || !book_id.trim() || isNaN(user_id) || isNaN(book_id)){
-            console.error("Invalid user id or book id provided.");
-            return res.status(400).send("Invalid user id or book id provided.");
-        }
-        const book = db.prepare(q).get(user_id, book_id);
-
-        if (book) {
-            return res.status(200).json(book);
-        } else {
-            const userExists = db.prepare("SELECT * FROM library WHERE user_id = ?").get(user_id);
-            if (userExists) {
-                return res.status(404).send("The book is not in your library.");
-            }
-            else{
-                return res.status(404).send("The user does not exist.");
-            }
-        }
-    } catch (error) {
+    try {} catch (error) {
         console.error("There is an error in userid+bookid : ", error.message);
         res.status(500).send("There is an error processing your request.");

[Killed] BooleanLiteral
routes/library.js:47:12
     const q = "SELECT * FROM library WHERE user_id = ? AND book_id = ?";
     
     try {
-        if(!user_id.trim() || !book_id.trim() || isNaN(user_id) || isNaN(book_id)){
+        if(user_id.trim() || !book_id.trim() || isNaN(user_id) || isNaN(book_id)){
             console.error("Invalid user id or book id provided.");
             return res.status(400).send("Invalid user id or book id provided.");
killedBy: GET /id/:user_id - Structural testing 1. Statement Coverage existent book
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
routes/library.js:47:12
     const q = "SELECT * FROM library WHERE user_id = ? AND book_id = ?";
     
     try {
-        if(!user_id.trim() || !book_id.trim() || isNaN(user_id) || isNaN(book_id)){
+        if(false){
             console.error("Invalid user id or book id provided.");
             return res.status(400).send("Invalid user id or book id provided.");
killedBy: GET /id/:user_id - Structural testing 1. Statement Coverage invalid input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
routes/library.js:53:13
         }
         const book = db.prepare(q).get(user_id, book_id);
 
-        if (book) {
+        if (true) {
             return res.status(200).json(book);
         } else {
killedBy: GET /id/:user_id - Structural testing 1. Statement Coverage non-existent book 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 200

[Killed] ConditionalExpression
routes/library.js:53:13
         }
         const book = db.prepare(q).get(user_id, book_id);
 
-        if (book) {
+        if (false) {
             return res.status(200).json(book);
         } else {
killedBy: GET /id/:user_id - Structural testing 1. Statement Coverage existent book
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Timeout] BlockStatement
routes/library.js:55:16
 
         if (book) {
             return res.status(200).json(book);
-        } else {
-            const userExists = db.prepare("SELECT * FROM library WHERE user_id = ?").get(user_id);
-            if (userExists) {
-                return res.status(404).send("The book is not in your library.");
-            }
-            else{
-                return res.status(404).send("The user does not exist.");
-            }
-        }
+        } else {}
     } catch (error) {
         console.error("There is an error in userid+bookid : ", error.message);

[Killed] StringLiteral
routes/library.js:56:43
         if (book) {
             return res.status(200).json(book);
         } else {
-            const userExists = db.prepare("SELECT * FROM library WHERE user_id = ?").get(user_id);
+            const userExists = db.prepare("").get(user_id);
             if (userExists) {
                 return res.status(404).send("The book is not in your library.");
killedBy: GET /id/:user_id - Structural testing 1. Statement Coverage non-existent book 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SELECT * FROM library WHERE user_id = ?"
Received: ""

[Killed] ConditionalExpression
routes/library.js:57:17
             return res.status(200).json(book);
         } else {
             const userExists = db.prepare("SELECT * FROM library WHERE user_id = ?").get(user_id);
-            if (userExists) {
+            if (false) {
                 return res.status(404).send("The book is not in your library.");
             }
killedBy: GET /id/:user_id - Structural testing 1. Statement Coverage non-existent book 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "The book is not in your library."
Received: "The user does not exist."

[Killed] ConditionalExpression
routes/library.js:57:17
             return res.status(200).json(book);
         } else {
             const userExists = db.prepare("SELECT * FROM library WHERE user_id = ?").get(user_id);
-            if (userExists) {
+            if (true) {
                 return res.status(404).send("The book is not in your library.");
             }
killedBy: GET /id/:user_id - Structural testing 1. Statement Coverage non-existent user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "The user does not exist."
Received: "The book is not in your library."

[Timeout] BlockStatement
routes/library.js:60:17
             if (userExists) {
                 return res.status(404).send("The book is not in your library.");
             }
-            else{
-                return res.status(404).send("The user does not exist.");
-            }
+            else{}
         }
     } catch (error) {

[Timeout] BlockStatement
routes/library.js:64:21
                 return res.status(404).send("The user does not exist.");
             }
         }
-    } catch (error) {
-        console.error("There is an error in userid+bookid : ", error.message);
-        res.status(500).send("There is an error processing your request.");
-    }
+    } catch (error) {}
 });
 
