[Killed] ConditionalExpression
routes/library.js:47:12
     const q = "SELECT * FROM library WHERE user_id = ? AND book_id = ?";
     
     try {
-        if(!user_id.trim() || !book_id.trim() || isNaN(user_id) || isNaN(book_id)){
+        if(false || isNaN(book_id)){
             console.error("Invalid user id or book id provided.");
             return res.status(400).send("Invalid user id or book id provided.");
killedBy: GET /id/:user_id - Functional testing 1. Equivalence Partitioning Tests invalid user_id and valid book_id  → should return 400"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404
